13/data/attachments/f68a2b38a7d6aca9.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_a60f3bfe-14c3-416c-bec0-18aa7960c8ea</nif:username>
            <nif:friendToBeAdded>Carolyn_our_Friend_28925_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>